js-evernote-backend/app/controllers/api/v1/notes_controller.rb

  def index
    notes = Note.all
---
SELECT "notes".* FROM "notes"

  def create
    note = Note.create(note_params)
---
INSERT INTO "notes" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "THIS WILL BE DELETED "], ["body", "THIS WILL BE DELETED"], ["created_at", "2018-02-08 14:59:56.255013"], ["updated_at", "2018-02-08 14:59:56.255013"]]

  def update
    @note.update(note_params)
---
UPDATE "notes" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", ""], ["body", ""], ["updated_at", "2018-02-08 19:44:23.067663"], ["id", 8]]

  def destroy
    noteId = @note.id
    @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 11]]